In [5]:
import mysql.connector
import pandas as pd

In [6]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Forgetme$786")

cursorObject = connection.cursor()

In [7]:
cursorObject.execute("CREATE DATABASE e_commerce")

In [8]:
connection.close()

In [9]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Forgetme$786",
                                     database = 'e_commerce'
                                    )
 
## creating a cursor object
cursorObject = connection.cursor()

In [11]:
table_creation_query = """create table supplier( SUPP_ID int primary key, SUPP_NAME varchar(50), 
                            SUPP_CITY varchar(50), SUPP_PHONE varchar(10));

                          create table customer(CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL,
                          CUS_PHONE VARCHAR(10),CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID));

                          create table category(CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,
                          PRIMARY KEY (CAT_ID));

                          create table product(PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL,
                          PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),
                          FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));

                          create table product_details(PROD_ID INT NOT NULL, PRO_ID INT NOT NULL,
                          SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL, PRIMARY KEY (PROD_ID),
                          FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID),
                          FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));

                          create table orders(ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE,
                          CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),
                          FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),
                          FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID));
                          
                          create table ratings (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL,
                          RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),
                          FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),
                          FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID));"""
                  
# Executing the query
cursorObject.execute(table_creation_query)

InterfaceError: Use multi=True when executing multiple statements

In [12]:
connection.close()
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Forgetme$786",
                                     database = 'e_commerce'
                                    )
 
## creating a cursor object
cursorObject = connection.cursor()

In [13]:
insert_supplier = """INSERT INTO supplier (SUPP_ID , SUPP_NAME, SUPP_CITY, SUPP_PHONE) 
                       VALUES (%s, %s, %s, %s)"""

val = [(1,'Rajesh Retails', 'Delhi', 1234567800),
       (2,'Appario Ltd.', 'Mumbai', 2589310000),
       (3,'Knome products', 'Banglore',97854315),
       (4,'Bansal Retails', 'Kochi', 89754285),
       (5,'Mittal Ltd.', 'Lucknow', 78984532)]
   
cursorObject.executemany(insert_supplier, val)
connection.commit()

In [14]:
insert_customer = """INSERT INTO customer (CUS_ID, CUS_NAME, CUS_PHONE,
                          CUS_CITY,CUS_GENDER) 
                       VALUES (%s, %s, %s, %s,%s)"""

val = [(1,'AAKASH', 9999999999, 'DELHI', 'M'),
       (2,'AMAN', 9785463215, 'NOIDA', 'M'),
      (3,'NEHA', 9999999998, 'MUMBAI', 'F'),
      (4,'MEGHA', 9994562399, 'KOLKATA', 'F'),
      (5,'PULKIT', 7895999999, 'LUCKNOW', 'M'),]
   

cursorObject.executemany(insert_customer, val)
connection.commit()

In [15]:
insert_category = """INSERT INTO category (CAT_ID, CAT_NAME) 
                       VALUES (%s, %s)"""

val = [(1,'BOOKS'),
       (2,'GAMES'),
       (3,'GROCERIES'),
       (4,'ELECTRONICS'),
       (5,'CLOTHS')]

cursorObject.executemany(insert_category, val)
connection.commit()

In [16]:
insert_product = """INSERT INTO product (PRO_ID, PRO_NAME,PRO_DESC, CAT_ID) 
                       VALUES (%s, %s,%s, %s)"""

val = [(1,'GTA V', 'DFJDJFDJFDJFDJFJF', 2),
       (2,'TSHIRT', 'DFDFJDFJDKFD', 5),
       (3,'ROG laptop', 'DFJDJFDJFDJFDJFJF', 4),
      (4,'OATS', 'REURENTBTOTH', 3),
      (5,'HARRY POTTER', 'NBEMCTHTJTH', 1),]

cursorObject.executemany(insert_product, val)
connection.commit()

In [17]:
insert_product_details = """INSERT INTO product_details(PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE)
                            VALUES(%s, %s,%s, %s)"""
val = [(1,1,2,1500),
       (2,3,5,30000),
       (3,5,1,3000),
       (4,2,3,2500),
       (5,4,1,1000)]

cursorObject.executemany(insert_product_details, val)
connection.commit()

In [18]:
insert_orders = """INSERT INTO orders(ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID,PROD_ID)
                            VALUES(%s, %s,%s, %s,%s)"""
val = [(20,1500,"2021-10-12",3,5),
       (25,30500,"2021-09-16",5,2),
      (26,2000,"2021-10-5",1,1),
      (30,3500, "2021-08-16",4,3),
      (50,2000,"2021-10-06",2,1),]

cursorObject.executemany(insert_orders, val)
connection.commit()

In [19]:
insert_ratings = """INSERT INTO ratings(RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS)
                            VALUES(%s, %s,%s, %s)"""
val = [(1,2,2,4),
       (2,3,4,3),
       (3,5,1,5),
       (4,1,3,2),
       (5,4,5,4)]

cursorObject.executemany(insert_ratings, val)
connection.commit()

In [20]:
##Q3) Display the number of the customer group by their genders who have placed
###any order of amount greater than or equal to Rs.3000.

q3 = """select a.cus_gender, count(*) from 
(select c.cus_gender,o.ord_amount,o.cus_id from customer as c
inner join e_commerce.orders as o on o.cus_id = c.cus_id where o.ord_amount>=3000)
as a group by a.cus_gender """

cursorObject.execute(q3)
output=cursorObject.fetchall()

output_df=pd.DataFrame(output,columns=['Gender','Count'])
output_df

  Gender  Count
0      M      1
1      F      1

In [21]:
### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

q4_ans = """ select o.ord_id,o.ord_amount, o.ord_date, o.cus_id, o.prod_id, p.pro_name from e_commerce.orders
as o inner join product as p on p.pro_id = o.prod_id where o.cus_id = 2"""

cursorObject.execute(q4_ans)
output=cursorObject.fetchall()

output_df=pd.DataFrame(output, columns=['Order_Id','Order_Amt','Order_Date', 'Customer_Id', 'Product_Id', 'Product_Name' ])
output_df

   Order_Id  Order_Amt  Order_Date  Customer_Id  Product_Id Product_Name
0        50       2000  2021-10-06            2           1        GTA V

In [40]:
### Q5) Display the Supplier details who can supply more than one product.

# q5= """select s.supp_id, s.supp_name, s.supp_city, s.supp_phone from supplier
# as s inner join product_details as p on p.supp_id = s.supp_id having count(s.supp_id)>1"""

q5 = """select s.* from supplier s where s.supp_id in
(select supp_id from product_details pd group by pd.supp_id having count(*)>1)"""

cursorObject.execute(q5)
output=cursorObject.fetchall()

print(output)
# output_df=pd.DataFrame(output,columns=['Supplier Id' , 'Supplier Name', 'City', 'Phone Number' ])
# output_df

[(1, 'Rajesh Retails', 'Delhi', '1234567800')]

In [31]:
### Q6) Find the category of the product whose order amount is minimum.

# q6=""" select min(a.cat_name) from e_commerce.orders as o inner join
# (select p.pro_id,c.cat_id,c.cat_name from product as p inner join category as c on c.cat_id = p.cat_id)
# as a on a.pro_id = o.prod_id """

q6 = "select cat_name from category c where cat_id = (Select cat_id from product where pro_id =(select pro_id from product_details where prod_id = (select prod_id from orders where ord_amount =(select min(ord_amount) from orders))))"


cursorObject.execute(q6)
output=cursorObject.fetchall()

print(output)

# output_df=pd.DataFrame(output, columns=['Category of Min Order'])
# output_df

[('GROCERIES',)]

In [42]:
### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

q7="""select pro_id, pro_name from product where pro_id in
(select prod_id from e_commerce.orders where ord_date >
"2021-10-05")"""


# q7="""select p.pro_id, p.pro_name from product p, product_details pd,
# orders od where p.pro_id = pd.pro_id and pd.prod_id = od.prod_id and ord_date >'2021-10-05'"""




cursorObject.execute(q7)
output=cursorObject.fetchall()


output_df=pd.DataFrame (output, columns=[ 'Product Id', 'Product Name' ])
output_df

   Product Id  Product Name
0           1         GTA V
1           5  HARRY POTTER

In [34]:
### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along
###with the customer name who has given the rating.


q8 =""" select s.supp_name, r.supp_id,r.rat_ratstars, c.cus_name from ratings as r
inner join customer as c on c.cus_id = r.cus_id
inner join supplier as s on s.supp_id = r.supp_id
order by r.rat_ratstars desc limit 3"""


cursorObject.execute(q8)
output=cursorObject.fetchall()

output_df=pd.DataFrame(output, columns=['Supplier Name', 'Supplier Id', 'Rating', 'Rating By Customer' ])
output_df

    Supplier Name  Supplier Id  Rating Rating By Customer
0  Rajesh Retails            1       5             PULKIT
1    Appario Ltd.            2       4               AMAN
2     Mittal Ltd.            5       4              MEGHA

In [35]:
### Q9) Display customer name and gender whose names start or end with character 'A'.


q9=""" select cus_name, cus_gender from customer where cus_name like 'a%' or cus_name like '%a'"""


cursorObject.execute(q9)
output=cursorObject.fetchall()


output_df=pd.DataFrame(output,columns=['Customer Name', 'Customer Gender' ])
output_df

  Customer Name Customer Gender
0        AAKASH               M
1          AMAN               M
2          NEHA               F
3         MEGHA               F

In [36]:
### Q10) Display the total order amount of the male customers.


q10=""" select sum(o.ord_amount) from e_commerce.orders as o inner join
(select cus_id from customer where cus_gender =
'M') as c on c.cus_id = o.cus_id """

cursorObject.execute(q10)
output=cursorObject.fetchall()


output_df=pd.DataFrame(output, columns=['TOT_ORD_AMT'])
output_df

  TOT_ORD_AMT
0       34500

In [37]:
### Q11) Display all the Customers left outer join with  the orders


q11=""" select * from customer as c left outer join e_commerce.Orders as O on O.cus_id = c.cus_id"""


cursorObject.execute(q11)
output = cursorObject.fetchall()


output_df=pd.DataFrame(output, columns=['CUS_ID', 'CUS _NAME', "CUS_PHONE", 'CUS_CITY', 'CUS_GENDER', 'ORD_ID', 'ORD_AMOUNT', 'ORD_DATE', 'CUST_ID', 'PROD_ID'])
output_df

,CUS_ID,CUS _NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,CUST_ID,PROD_ID
0,1,AAKASH,9999999999,DELHI,M,26,2000,2021-10-05,1,1
1,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-06,2,1
2,3,NEHA,9999999998,MUMBAI,F,20,1500,2021-10-12,3,5
3,4,MEGHA,9994562399,KOLKATA,F,30,3500,2021-08-16,4,3
4,5,PULKIT,7895999999,LUCKNOW,M,25,30500,2021-09-16,5,2